In [1]:
import pandas as pd

In [2]:
df = pd.read_excel("../xl/course_participants.xlsx")

In [3]:
df

   user_id   name  age  country  score continent
0     1001   Mark   55    Italy    4.5    Europe
1     1000   John   33      USA    6.7   America
2     1002    Tim   41      USA    3.9   America
3     1003  Jenny   12  Germany    9.0    Europe

In [4]:
data=[["Mark", 55, "Italy", 4.5, "Europe"],
     ["John", 33, "USA", 6.7, "America"],
     ["Tim", 41, "USA", 3.9, "America"],
     ["Jenny", 12, "Germany", 9.0, "Europe"]]
df = pd.DataFrame(data=data,columns=["name","age","country","score","continent"],index=[1001,1000,1002,1003])

In [5]:
# df = df.set_index([]"user_id"])
df.index.name = "user_id"
df

          name  age  country  score continent
user_id
1001      Mark   55    Italy    4.5    Europe
1000      John   33      USA    6.7   America
1002       Tim   41      USA    3.9   America
1003     Jenny   12  Germany    9.0    Europe

In [6]:
# df.reindex([999,1000,1001,1002])

In [7]:
tf = (df["age"] > 40) & (df["country"] == "USA")
tf

user_id
1001    False
1000    False
1002     True
1003    False
dtype: bool

In [8]:
df.loc[tf,:]

        name  age country  score continent
user_id
1002     Tim   41     USA    3.9   America

In [9]:
df.loc[df.index>1001,:]

          name  age  country  score continent
user_id
1002       Tim   41      USA    3.9   America
1003     Jenny   12  Germany    9.0    Europe

In [10]:
df.loc[df["country"].isin(["Italy","Germany"]),:]

          name  age  country  score continent
user_id
1001      Mark   55    Italy    4.5    Europe
1003     Jenny   12  Germany    9.0    Europe

In [11]:
rainfall = pd.DataFrame(data={"City1":[300.1,100.2],
                                "City2":[400.3,300.4],
                                "City3":[1000.5,1100.6]})

In [12]:
rainfall

   City1  City2   City3
0  300.1  400.3  1000.5
1  100.2  300.4  1100.6

In [13]:
rainfall < 400

   City1  City2  City3
0   True  False  False
1   True   True  False

In [14]:
rainfall[rainfall<400]

   City1  City2  City3
0  300.1    NaN    NaN
1  100.2  300.4    NaN

In [15]:
df

          name  age  country  score continent
user_id
1001      Mark   55    Italy    4.5    Europe
1000      John   33      USA    6.7   America
1002       Tim   41      USA    3.9   America
1003     Jenny   12  Germany    9.0    Europe

In [16]:
df_multi = df.reset_index().set_index(["continent","country"])
df_multi = df_multi.sort_index()
df_multi

                   user_id   name  age  score
continent country
America   USA         1000   John   33    6.7
          USA         1002    Tim   41    3.9
Europe    Germany     1003  Jenny   12    9.0
          Italy       1001   Mark   55    4.5

In [17]:
df_multi.loc["Europe",:]

         user_id   name  age  score
country
Germany     1003  Jenny   12    9.0
Italy       1001   Mark   55    4.5

In [18]:
df_multi.loc[("Europe","Italy"),:]

                   user_id  name  age  score
continent country
Europe    Italy       1001  Mark   55    4.5

In [19]:
df_multi.reset_index(level=0)

        continent  user_id   name  age  score
country
USA       America     1000   John   33    6.7
USA       America     1002    Tim   41    3.9
Germany    Europe     1003  Jenny   12    9.0
Italy      Europe     1001   Mark   55    4.5

In [20]:
df2 = df.copy()

In [21]:
df2.loc[1000,"name"] = "JOHN"
df2

          name  age  country  score continent
user_id
1001      Mark   55    Italy    4.5    Europe
1000      JOHN   33      USA    6.7   America
1002       Tim   41      USA    3.9   America
1003     Jenny   12  Germany    9.0    Europe

In [22]:
df2.loc[[1000,1001],"score"] = [3,4]
df2

          name  age  country  score continent
user_id
1001      Mark   55    Italy    4.0    Europe
1000      JOHN   33      USA    3.0   America
1002       Tim   41      USA    3.9   America
1003     Jenny   12  Germany    9.0    Europe

In [23]:
tf = (df2["age"] < 20) | (df2["country"] == "USA")
df2.loc[tf,"name"] = "xxx"
df2

         name  age  country  score continent
user_id
1001     Mark   55    Italy    4.0    Europe
1000      xxx   33      USA    3.0   America
1002      xxx   41      USA    3.9   America
1003      xxx   12  Germany    9.0    Europe

In [24]:
rainfall2 = rainfall.copy()
rainfall2

   City1  City2   City3
0  300.1  400.3  1000.5
1  100.2  300.4  1100.6

In [25]:
df2.replace("USA","U.S.")
df2.replace({"country":{"USA":"U.S."}})

         name  age  country  score continent
user_id
1001     Mark   55    Italy    4.0    Europe
1000      xxx   33     U.S.    3.0   America
1002      xxx   41     U.S.    3.9   America
1003      xxx   12  Germany    9.0    Europe

## Setting data by adding a new column

In [26]:
df2.loc[:,"discount"]=0
df2.loc[:,"price"] = [49.9,49.9,99.9,99.9]
df2

         name  age  country  score continent  discount  price
user_id
1001     Mark   55    Italy    4.0    Europe         0   49.9
1000      xxx   33      USA    3.0   America         0   49.9
1002      xxx   41      USA    3.9   America         0   99.9
1003      xxx   12  Germany    9.0    Europe         0   99.9

In [27]:
df2 = df.copy()
df2.loc[:,"birth year"] = 2021 - df2["age"]
df2

          name  age  country  score continent  birth year
user_id
1001      Mark   55    Italy    4.5    Europe        1966
1000      John   33      USA    6.7   America        1988
1002       Tim   41      USA    3.9   America        1980
1003     Jenny   12  Germany    9.0    Europe        2009

In [28]:
df2= df.copy()
df2.loc[1000,"score"] = None
df2.loc[1003, :] = None
df2

         name   age country  score continent
user_id
1001     Mark  55.0   Italy    4.5    Europe
1000     John  33.0     USA    NaN   America
1002      Tim  41.0     USA    3.9   America
1003     None   NaN    None    NaN      None

In [29]:
#Remove rows with missing data
df2.dropna()

         name   age country  score continent
user_id
1001     Mark  55.0   Italy    4.5    Europe
1002      Tim  41.0     USA    3.9   America

In [30]:
df2.dropna(how="all") #delete rows with all missing data

         name   age country  score continent
user_id
1001     Mark  55.0   Italy    4.5    Europe
1000     John  33.0     USA    NaN   America
1002      Tim  41.0     USA    3.9   America

In [31]:
df2.isna() #Return is Na or not

          name    age  country  score  continent
user_id
1001     False  False    False  False      False
1000     False  False    False   True      False
1002     False  False    False  False      False
1003      True   True     True   True       True

In [32]:
df2.fillna({"score":df2["score"].mean()}) #fill in Na with mean

         name   age country  score continent
user_id
1001     Mark  55.0   Italy    4.5    Europe
1000     John  33.0     USA    4.2   America
1002      Tim  41.0     USA    3.9   America
1003     None   NaN    None    4.2      None

### Duplicate Data

In [33]:
df.drop_duplicates(["country","continent"])

          name  age  country  score continent
user_id
1001      Mark   55    Italy    4.5    Europe
1000      John   33      USA    6.7   America
1003     Jenny   12  Germany    9.0    Europe

In [34]:
df["country"].is_unique #Return whether contains duplicates

False

In [35]:
df["country"].unique() #Return array of unique values

array(['Italy', 'USA', 'Germany'], dtype=object)

In [36]:
df["country"].duplicated()

user_id
1001    False
1000    False
1002     True
1003    False
Name: country, dtype: bool

In [37]:
df.loc[df["country"].duplicated(keep=False)] #To get all rows where "country" is duplicated

         name  age country  score continent
user_id
1000     John   33     USA    6.7   America
1002      Tim   41     USA    3.9   America

In [38]:
rainfall

   City1  City2   City3
0  300.1  400.3  1000.5
1  100.2  300.4  1100.6

In [39]:
rainfall + 100

   City1  City2   City3
0  400.1  500.3  1100.5
1  200.2  400.4  1200.6

In [40]:
more_rainfall = pd.DataFrame(data=[[100,200],[300,400]],
                            index=[1,2],
                            columns=["City1","City4"])
more_rainfall

   City1  City4
1    100    200
2    300    400

In [41]:
rainfall + more_rainfall

   City1  City2  City3  City4
0    NaN    NaN    NaN    NaN
1  200.2    NaN    NaN    NaN
2    NaN    NaN    NaN    NaN

In [42]:
rainfall.add(more_rainfall,fill_value=0)

   City1  City2   City3  City4
0  300.1  400.3  1000.5    NaN
1  200.2  300.4  1100.6  200.0
2  300.0    NaN     NaN  400.0

In [43]:
rainfall.loc[1,:]

City1     100.2
City2     300.4
City3    1100.6
Name: 1, dtype: float64

In [44]:
rainfall.loc[:,"City2"]

0    400.3
1    300.4
Name: City2, dtype: float64

In [45]:
rainfall.add(rainfall.loc[:,"City2"],axis=0)

   City1  City2   City3
0  700.4  800.6  1400.8
1  400.6  600.8  1401.0

In [46]:
users = pd.DataFrame(data=[" mArk ","JOHN ","Tim","jenny"],columns=["name"])
users

     name
0   mArk
1   JOHN
2     Tim
3   jenny

In [47]:
users_cleaned = users.loc[:,"name"].str.strip().str.capitalize()
users_cleaned

0     Mark
1     John
2      Tim
3    Jenny
Name: name, dtype: object

In [48]:
users_cleaned.str.startswith("J")

0    False
1     True
2    False
3     True
Name: name, dtype: bool

In [49]:
rainfall

   City1  City2   City3
0  300.1  400.3  1000.5
1  100.2  300.4  1100.6

In [50]:
def format_string(x):
    return f"{x:,.2f}"
rainfall.applymap(format_string)

    City1   City2     City3
0  300.10  400.30  1,000.50
1  100.20  300.40  1,100.60

In [53]:
rainfall.applymap(lambda x: f"{x:,.2f}")

    City1   City2     City3
0  300.10  400.30  1,000.50
1  100.20  300.40  1,100.60

### Concatenating

In [60]:
data=[[15,"France",4.1,"Becky"],[44,"Canada",6.1,"Leanne"]]
more_users = pd.DataFrame(data=data, columns=["age","country","score","name"],
                                              index=[1000,1011])
more_users

      age country  score    name
1000   15  France    4.1   Becky
1011   44  Canada    6.1  Leanne

In [61]:
pd.concat([df, more_users],axis=0)

        name  age  country  score continent
1001    Mark   55    Italy    4.5    Europe
1000    John   33      USA    6.7   America
1002     Tim   41      USA    3.9   America
1003   Jenny   12  Germany    9.0    Europe
1000   Becky   15   France    4.1       NaN
1011  Leanne   44   Canada    6.1       NaN

In [65]:
data=[[3,4],
     [5,6]]
more_categories =pd.DataFrame(data=data, columns=["quizzes","logins"],
                             index=[1000,2000])
more_categories

      quizzes  logins
1000        3       4
2000        5       6

In [66]:
pd.concat([df, more_categories],axis=1)

       name   age  country  score continent  quizzes  logins
1001   Mark  55.0    Italy    4.5    Europe      NaN     NaN
1000   John  33.0      USA    6.7   America      3.0     4.0
1002    Tim  41.0      USA    3.9   America      NaN     NaN
1003  Jenny  12.0  Germany    9.0    Europe      NaN     NaN
2000    NaN   NaN      NaN    NaN       NaN      5.0     6.0

In [68]:
df1 = pd.DataFrame(data=[[1,2],[3,4],[5,6]],columns=["A","B"])
df1

   A  B
0  1  2
1  3  4
2  5  6

In [71]:
df2 = pd.DataFrame(data=[[10,20],[30,40]],columns=["C","D"],index=[1,3])
df2

    C   D
1  10  20
3  30  40

In [72]:
df1.join(df2, how="inner")

   A  B   C   D
1  3  4  10  20

In [73]:
df1.join(df2, how="left")

   A  B     C     D
0  1  2   NaN   NaN
1  3  4  10.0  20.0
2  5  6   NaN   NaN

In [75]:
df1.join(df2, how="right")

     A    B   C   D
1  3.0  4.0  10  20
3  NaN  NaN  30  40

In [76]:
df1.join(df2,how="outer")

     A    B     C     D
0  1.0  2.0   NaN   NaN
1  3.0  4.0  10.0  20.0
2  5.0  6.0   NaN   NaN
3  NaN  NaN  30.0  40.0

In [77]:
df1["category"] = ["a","b","c"] #Add a column called "category"
df2["category"] = ["c","b"]

In [78]:
df1

   A  B category
0  1  2        a
1  3  4        b
2  5  6        c

In [79]:
df2

    C   D category
1  10  20        c
3  30  40        b

In [80]:
df1.merge(df2, how="inner", on=["category"])

   A  B category   C   D
0  3  4        b  30  40
1  5  6        c  10  20

In [81]:
df1.merge(df2, how="left", on=["category"])

   A  B category     C     D
0  1  2        a   NaN   NaN
1  3  4        b  30.0  40.0
2  5  6        c  10.0  20.0

## Descriptive Statistics and Data Aggregation

In [82]:
rainfall

   City1  City2   City3
0  300.1  400.3  1000.5
1  100.2  300.4  1100.6

In [84]:
rainfall.mean()

City1     200.15
City2     350.35
City3    1050.55
dtype: float64

In [85]:
rainfall.mean(axis=1)

0    566.966667
1    500.400000
dtype: float64

### Grouping

In [86]:
df.groupby(["continent"]).mean()

            age  score
continent
America    37.0   5.30
Europe     33.5   6.75

In [87]:
df.groupby(["continent","country"]).mean()

                    age  score
continent country
America   USA      37.0    5.3
Europe    Germany  12.0    9.0
          Italy    55.0    4.5

In [88]:
df.groupby(["continent"]).agg(lambda x: x.max() - x.min())

C:\Users\Samsung\AppData\Local\Temp\ipykernel_32956\475847912.py:1: FutureWarning: ['name', 'country'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df.groupby(["continent"]).agg(lambda x: x.max() - x.min())

           age  score
continent
America      8    2.8
Europe      43    4.5

### Pivoting and Melting

In [93]:
data=[["Oranges","North",12.30],
      ["Apples","South",10.55],
      ["Oranges","South",22.00],
      ["Bananas","South",5.90],
      ["Bananas","North",31.30],
      ["Oranges","North",13.10]]
sales = pd.DataFrame(data=data, columns=["Fruit","Region","Revenue"])
sales

     Fruit Region  Revenue
0  Oranges  North    12.30
1   Apples  South    10.55
2  Oranges  South    22.00
3  Bananas  South     5.90
4  Bananas  North    31.30
5  Oranges  North    13.10

In [96]:
pivot = pd.pivot_table(sales, index='Fruit', columns='Region',
                       values='Revenue', aggfunc='sum',
                       margins=True, margins_name='Total')
pivot

Region   North  South  Total
Fruit
Apples     NaN  10.55  10.55
Bananas   31.3   5.90  37.20
Oranges   25.4  22.00  47.40
Total     56.7  38.45  95.15

In [99]:
pd.melt(pivot.iloc[:-1,:-1].reset_index(), id_vars="Fruit",
        value_vars=["North", "South"],value_name="Revenue")

     Fruit Region  Revenue
0   Apples  North      NaN
1  Bananas  North    31.30
2  Oranges  North    25.40
3   Apples  South    10.55
4  Bananas  South     5.90
5  Oranges  South    22.00